app/controllers/clientes_controller.rb

  def index
    #@clientes = Cliente.all
    @clientes = Cliente.search(params[:search], params[:page])
---
SELECT  "clientes".* FROM "clientes" WHERE (upper(nombre) like '%%')  ORDER BY nombre LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "clientes" WHERE (upper(nombre) like '%%')

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("nombre", "telefono", "celular", "barrio", "direccion", "referenciadir", "hora", "ocacion", "valor", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "telefono" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["telefono", "home start"], ["updated_at", "2015-06-12 03:11:28.295104"], ["id", 61]]